In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
from datetime import timedelta
import time

In [3]:
df = pd.read_csv('../data/marathon_results_2016.csv',
                 index_col='Bib',
                 usecols=['Bib','40K','Half','Pace','Age','M/F','Country','State','City'])

df['40K'] = df['40K'].apply(pd.to_timedelta)
df['Half'] = df['Half'].apply(pd.to_timedelta)

df['TotalSeconds'] = df['40K'].apply(lambda x: timedelta.total_seconds(x))
df['HalfSeconds'] = df['Half'].apply(lambda x: timedelta.total_seconds(x))

df.head()

,Age,M/F,City,State,Country,Half,40K,Pace,TotalSeconds,HalfSeconds
Bib,,,,,,,,,,
5,21,M,Addis Ababa,NaN,ETH,0 days 01:06:45,0 days 02:05:59,0:05:04,7559.0,4005.0
1,26,M,Ambo,NaN,ETH,0 days 01:06:46,0 days 02:05:59,0:05:06,7559.0,4006.0
6,31,M,Addis Ababa,NaN,ETH,0 days 01:06:44,0 days 02:06:47,0:05:07,7607.0,4004.0
11,33,M,Kitale,NaN,KEN,0 days 01:06:46,0 days 02:06:47,0:05:07,7607.0,4006.0
14,23,M,Eldoret,NaN,KEN,0 days 01:06:46,0 days 02:08:11,0:05:11,7691.0,4006.0

In [4]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 26630 entries, 5 to 28487
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Age           26630 non-null  int64
 1   M/F           26630 non-null  object
 2   City          26629 non-null  object
 3   State         23783 non-null  object
 4   Country       26630 non-null  object
 5   Half          26630 non-null  timedelta64[ns]
 6   40K           26630 non-null  timedelta64[ns]
 7   Pace          26630 non-null  object
 8   TotalSeconds  26630 non-null  float64
 9   HalfSeconds   26630 non-null  float64
dtypes: float64(2), int64(1), object(5), timedelta64[ns](2)
memory usage: 10.3 MB

In [5]:
df.describe()

,Age,Half,40K,TotalSeconds,HalfSeconds
count,26630.000000,26630,26630,26630.000000,26630.000000
mean,42.514044,0 days 01:49:25.497070972,0 days 03:41:49.984829140,13309.984829,6565.497071
std,11.347955,0 days 00:18:06.943013477,0 days 00:39:13.302840884,2353.302841,1086.943013
min,18.000000,0 days 00:00:00,0 days 00:00:00,0.000000,0.000000
25%,34.000000,0 days 01:36:51,0 days 03:14:50.250000,11690.250000,5811.000000
50%,43.000000,0 days 01:47:00,0 days 03:35:13,12913.000000,6420.000000
75%,51.000000,0 days 01:58:32,0 days 04:02:20,14540.000000,7112.000000
max,83.000000,0 days 04:47:17,0 days 07:59:12,28752.000000,17237.000000

In [19]:
df['City'].value_counts()

Boston           722
New York         451
Chicago          261
Toronto          223
San Francisco    197
                ...
Ayer's Cliff       1
Deer River         1
Ansonia            1
Brugge             1
Craig              1
Name: City, Length: 5832, dtype: int64

In [11]:
df['City'].unique()

array(['Addis Ababa', 'Ambo', 'Kitale', ..., 'Justin', 'Rossmoor',
       'Reedsburg'], dtype=object)

In [12]:
df['City'].nunique()

5832

In [13]:
cities = df['City'].unique()

In [14]:
cities

array(['Addis Ababa', 'Ambo', 'Kitale', ..., 'Justin', 'Rossmoor',
       'Reedsburg'], dtype=object)

In [15]:
groups = {}

In [20]:
for city in cities:
    tmp_df = df.loc[df["City"] == city]
    groups[city] = tmp_df

In [ ]:
groups